In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
string_data.fillna(method = 'bfill')

0    artichoke
1    artichoke
2      avocado
3      avocado
dtype: object

In [9]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [10]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [11]:
from numpy import nan as NA

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [16]:
cleaned = data.dropna()

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4] = NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.randn(7, 3))

In [24]:
df.iloc[:4, 1] = NA

In [25]:
df.iloc[:2, 2] = NA

In [26]:
df

          0         1         2
0  0.198950       NaN       NaN
1  1.657464       NaN       NaN
2 -1.575609       NaN -1.643376
3 -0.862841       NaN -0.968532
4  0.757501 -0.048100 -0.153039
5  2.104878  1.401987  0.704330
6 -0.795554  1.818139 -0.130276

In [27]:
df.dropna()

          0         1         2
4  0.757501 -0.048100 -0.153039
5  2.104878  1.401987  0.704330
6 -0.795554  1.818139 -0.130276

In [28]:
df.dropna(thresh=2)

          0         1         2
2 -1.575609       NaN -1.643376
3 -0.862841       NaN -0.968532
4  0.757501 -0.048100 -0.153039
5  2.104878  1.401987  0.704330
6 -0.795554  1.818139 -0.130276

In [29]:
df.fillna(0)

          0         1         2
0  0.198950  0.000000  0.000000
1  1.657464  0.000000  0.000000
2 -1.575609  0.000000 -1.643376
3 -0.862841  0.000000 -0.968532
4  0.757501 -0.048100 -0.153039
5  2.104878  1.401987  0.704330
6 -0.795554  1.818139 -0.130276

In [30]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.198950  0.500000  0.000000
1  1.657464  0.500000  0.000000
2 -1.575609  0.500000 -1.643376
3 -0.862841  0.500000 -0.968532
4  0.757501 -0.048100 -0.153039
5  2.104878  1.401987  0.704330
6 -0.795554  1.818139 -0.130276

In [31]:
_ = df.fillna(0, inplace=True)

In [32]:
df

          0         1         2
0  0.198950  0.000000  0.000000
1  1.657464  0.000000  0.000000
2 -1.575609  0.000000 -1.643376
3 -0.862841  0.000000 -0.968532
4  0.757501 -0.048100 -0.153039
5  2.104878  1.401987  0.704330
6 -0.795554  1.818139 -0.130276

In [33]:
df = pd.DataFrame(np.random.randn(6, 3))

In [34]:
df.iloc[2:, 1] = NA

In [35]:
df.iloc[4:, 2] = NA

In [36]:
df

          0       1         2
0 -1.480544  0.2716 -0.063443
1  0.191677 -0.3666 -1.162646
2  1.103126     NaN  1.402074
3  0.788618     NaN  3.363311
4  0.821729     NaN       NaN
5  0.261448     NaN       NaN

In [37]:
df.fillna(method='ffill')

          0       1         2
0 -1.480544  0.2716 -0.063443
1  0.191677 -0.3666 -1.162646
2  1.103126 -0.3666  1.402074
3  0.788618 -0.3666  3.363311
4  0.821729 -0.3666  3.363311
5  0.261448 -0.3666  3.363311

In [38]:
df.fillna(method='ffill', limit=2)

          0       1         2
0 -1.480544  0.2716 -0.063443
1  0.191677 -0.3666 -1.162646
2  1.103126 -0.3666  1.402074
3  0.788618 -0.3666  3.363311
4  0.821729     NaN  3.363311
5  0.261448     NaN  3.363311

In [39]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [40]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [41]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [42]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [43]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [44]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [45]:
data['v1'] = range(7)

In [46]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [48]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [49]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [50]:
meat_to_animal = {'bacon': 'pig','pulled pork': 'pig','pastrami': 'cow','corned beef': 'cow','honey ham': 'pig','nova lox': 'salmon'}

In [51]:
lowercased = data['food'].str.lower()

In [52]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [53]:
data['animal'] = lowercased.map(meat_to_animal)

In [54]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [55]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [56]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [57]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [58]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [60]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [61]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [63]:
transform = lambda x: x[:4].upper()

In [64]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [65]:
data.index = data.index.map(transform)

In [66]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [67]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [68]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [69]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [70]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [71]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [72]:
bins = [18, 25, 35, 60, 100]

In [73]:
cats = pd.cut(ages, bins)

In [74]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [75]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [76]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [77]:
 pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [78]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [79]:
 group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [80]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [81]:
data = np.random.rand(20)

In [82]:
pd.cut(data, 4, precision=2)

[(0.69, 0.91], (0.46, 0.69], (0.69, 0.91], (0.46, 0.69], (0.46, 0.69], ..., (0.46, 0.69], (0.0085, 0.23], (0.46, 0.69], (0.69, 0.91], (0.46, 0.69]]
Length: 20
Categories (4, interval[float64, right]): [(0.0085, 0.23] < (0.23, 0.46] < (0.46, 0.69] < (0.69, 0.91]]

In [83]:
data = np.random.randn(1000)

In [84]:
cats = pd.qcut(data, 4)

In [85]:
cats

[(-0.661, 0.0357], (0.0357, 0.681], (-0.661, 0.0357], (-0.661, 0.0357], (0.681, 2.737], ..., (-0.661, 0.0357], (-3.0309999999999997, -0.661], (-0.661, 0.0357], (0.681, 2.737], (-0.661, 0.0357]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.0309999999999997, -0.661] < (-0.661, 0.0357] < (0.0357, 0.681] < (0.681, 2.737]]

In [86]:
pd.value_counts(cats)

(-3.0309999999999997, -0.661]    250
(-0.661, 0.0357]                 250
(0.0357, 0.681]                  250
(0.681, 2.737]                   250
dtype: int64

In [87]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.275, 0.0357], (0.0357, 1.311], (-1.275, 0.0357], (-1.275, 0.0357], (0.0357, 1.311], ..., (-1.275, 0.0357], (-1.275, 0.0357], (-1.275, 0.0357], (0.0357, 1.311], (-1.275, 0.0357]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.0309999999999997, -1.275] < (-1.275, 0.0357] < (0.0357, 1.311] < (1.311, 2.737]]

In [88]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [89]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003412    -0.041763    -0.046204     0.009199
std       0.964809     1.019337     1.019113     1.030499
min      -3.164832    -3.418509    -3.419804    -3.206014
25%      -0.669181    -0.719435    -0.688462    -0.675470
50%       0.016116    -0.008942    -0.054439     0.030733
75%       0.655623     0.565180     0.626715     0.692542
max       2.941180     3.453425     2.886095     3.597427

In [90]:
col = data[2]

In [91]:
col[np.abs(col) > 3]

174   -3.419804
472   -3.209395
647   -3.204979
Name: 2, dtype: float64

In [92]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
94   0.116396 -0.709282  0.761155  3.597427
117 -3.164832 -2.117375 -0.103203 -0.505298
174 -0.325084  0.936343 -3.419804 -0.820681
216  0.539612 -0.976384  0.080900 -3.123398
472  0.065821  0.382575 -3.209395 -0.678340
567  0.578966 -3.418509  0.395422 -0.581423
588 -0.112148  3.453425 -0.170373 -0.926855
627 -1.439620  0.041483 -0.341244 -3.060043
647 -0.627453 -1.296520 -3.204979 -0.723162
718  0.220361 -1.050325 -2.143593 -3.206014
860  0.053277 -2.643103 -0.142500  3.040899

In [93]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [94]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003247    -0.041798    -0.045370     0.008950
std       0.964282     1.016576     1.016561     1.027297
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.669181    -0.719435    -0.688462    -0.675470
50%       0.016116    -0.008942    -0.054439     0.030733
75%       0.655623     0.565180     0.626715     0.692542
max       2.941180     3.000000     2.886095     3.000000

In [95]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0  1.0  1.0  1.0
2  1.0 -1.0 -1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4  1.0 -1.0 -1.0 -1.0

In [96]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [97]:
sampler = np.random.permutation(5)

In [98]:
sampler

array([1, 3, 0, 4, 2])

In [99]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [100]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [101]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15

In [102]:
choices = pd.Series([5, 7, -1, 6, 4])

In [103]:
draws = choices.sample(n=10, replace=True)

In [104]:
draws

0    5
4    4
1    7
2   -1
4    4
2   -1
0    5
4    4
1    7
3    6
dtype: int64

In [105]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [106]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [107]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [108]:
df_with_dummy = df[['data1']].join(dummies)

In [109]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [110]:
mnames = ['movie_id', 'title', 'genres']

In [111]:
movies = pd.read_table('movies.dat', sep='::',
                       header=None, names=mnames,encoding='latin-1')

C:\Users\asus\anaconda3\lib\site-packages\pandas\util\_decorators.py:311: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return func(*args, **kwargs)

In [112]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [113]:
all_genres = []

In [114]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [115]:
genres = pd.unique(all_genres)

In [116]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [117]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [118]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [119]:
gen = movies.genres[0]

In [120]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [121]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [122]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [123]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [124]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [125]:
np.random.seed(12345)

In [126]:
values = np.random.rand(10)

In [127]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [128]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [129]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [130]:
val = 'a,b, guido'

In [131]:
val.split(',')

['a', 'b', ' guido']

In [132]:
pieces = [x.strip() for x in val.split(',')]

In [133]:
pieces

['a', 'b', 'guido']

In [134]:
first, second, third = pieces

In [135]:
first + '::' + second + '::' + third

'a::b::guido'

In [136]:
'::'.join(pieces)

'a::b::guido'

In [137]:
'guido' in val

True

In [138]:
val.index(',')

1

In [139]:
val.find(':')

-1

In [140]:
val.index(':')

ValueError: substring not found

In [142]:
val.count(',')

2

In [143]:
val.replace(',', '::')

'a::b:: guido'

In [144]:
val.replace(',', '')

'ab guido'

In [145]:
val.count('b')

1

In [146]:
val = 'Regular expressions can also be used with many of these operations,Regular expressions can also be used with many of these operations'

In [147]:
val.count('can')

2

In [148]:
val.endswith('operations')

True

In [149]:
val.startswith('Regular')

True

In [150]:
vall = 'Python built-in string methods'

In [151]:
'.'.join(vall)

'P.y.t.h.o.n. .b.u.i.l.t.-.i.n. .s.t.r.i.n.g. .m.e.t.h.o.d.s'

In [152]:
vall.index('o')

4

In [153]:
vall.find('z')

-1

In [154]:
vall.rfind('o')

27

In [155]:
val = 'Regular expressions can also be used with many of these operations,Regular expressions can also be used with many of these operations'

In [156]:
val.replace('many','few')

'Regular expressions can also be used with few of these operations,Regular expressions can also be used with few of these operations'

In [157]:
val = 'Regular expressions can also be used with many of these operations,Regular expressions can also be used with many of these operations'

In [158]:
val.replace('many','few',1)

'Regular expressions can also be used with few of these operations,Regular expressions can also be used with many of these operations'

In [159]:
vall = '   Python built-in   string methods   '

In [160]:
vall

'   Python built-in   string methods   '

In [161]:
vall.strip()

'Python built-in   string methods'

In [162]:
vall.rstrip()

'   Python built-in   string methods'

In [163]:
vall.lstrip()

'Python built-in   string methods   '

In [164]:
vall = "Python built-in string methods"

In [165]:
vall.split('-')

['Python built', 'in string methods']

In [166]:
vall.lower()

'python built-in string methods'

In [167]:
vall.upper()

'PYTHON BUILT-IN STRING METHODS'

In [168]:
vall.casefold()

'python built-in string methods'

In [169]:
vall.rjust(40,'_')

'__________Python built-in string methods'

In [170]:
vall.ljust(40,'*')

'Python built-in string methods**********'

In [171]:
movies["genres"].str.ljust(15,'_')

0        Animation|Children's|Comedy
1       Adventure|Children's|Fantasy
2                    Comedy|Romance_
3                    Comedy|Drama___
4                    Comedy_________
                    ...
3878                 Comedy_________
3879                 Drama__________
3880                 Drama__________
3881                 Drama__________
3882                 Drama|Thriller_
Name: genres, Length: 3883, dtype: object

In [172]:
movies["genres"].str.rjust(15,'*')

0        Animation|Children's|Comedy
1       Adventure|Children's|Fantasy
2                    *Comedy|Romance
3                    ***Comedy|Drama
4                    *********Comedy
                    ...
3878                 *********Comedy
3879                 **********Drama
3880                 **********Drama
3881                 **********Drama
3882                 *Drama|Thriller
Name: genres, Length: 3883, dtype: object